[
      {
        
        "title": "Doa Sebelum Masuk Tandas",
        "dua": "اللَّهُـمَّ إِنِّي أَعُـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبَائِث",
        "meaning": "Dengan nama Allah, Ya Allah aku berlindung denganMu daripada syaitan jantan dan syaitan betina"
      },
      {
        "id": 2,
        "title": "Doa Ketika Keluar Tandas",
        "dua": "غُفْرَانَكَ الْحَمْدُ ِللهِ الَّذِىْ اَذْهَبَ عَنّى اْلاَذَى وَعَافَانِىْ",
        "meaning": "Dengan mengharap ampunanMu, segala puji milik Allah yang telah menghilangkan kotoran dari badanku"
      },
      {
        "id": 3,
        "title": "Doa Sebelum Belajar",
        "dua": "يَارَبِّ زِدْنِىْ عِلْمًا وَارْزُقْنِىْ فَهْمًا",
        "meaning": "Ya Allah, tambahkanlah aku ilmu dan berikanlah aku rezeki akan kefahaman"
      },
      {
        "id": 4,
        "title": "Doa Selepas Azan",
        "dua": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّداً الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَاماً مَحْمُوداً الَّذِي وَعَدْتَهُ، إَنَّكَ لَا تُخْلِفُ الْمِيعَادَ",
        "meaning": "Ya Allah, Tuhan yang telah mensyariatkan seruan Azan yang sempurna dan solat yang akan didirikan, kurniakanlah kepada Nabi Muhammad keutamaan dan kelebihan, kemuliaan dan darjat yang tinggi serta limpahkanlah kepadanya kedudukan yang terpuji yang telah Engkau janjikan."
      },
      {
        "id": 5,
        "title": "Doa Sebelum Makan",
        "dua": "اَللّٰهُمَّ بَارِكْ لَنَا فِيْمَا رَزَقْتَنَا وَقِنَا عَذَابَ النَّارِ",
        "meaning": "Ya Allah, berkatilah kami dalam rezeki yang telah Engkau berikan kepada kami dan peliharalah kami dari azab api neraka"
      },
      {
        "id": 6,
        "title": "Doa Selepas Makan",
        "dua": "اَلْحَمْدُ ِللهِ الَّذِىْ اَطْعَمَنَا وَسَقَانَا وَجَعَلَنَا مُسْلِمِيْنَ",
        "meaning": "Segala puji bagi Allah yang telah memberi makan kami dan minuman kami, serta menjadikan kami sebagai orang-orang islam"
      },
      {
        "id": 7,
        "title": "Doa Sebelum Tidur",
        "dua": "بِسْمِكَ اللّٰهُمَّ اَحْيَا وَاَمُوْتُ",
        "meaning": "Dengan menyebut nama-Mu ya Allah, aku hidup dan aku mati"
      },
      {
        "id": 8,
        "title": "Doa Bangun Tidur",
        "dua": "اَلْحَمْدُ ِللهِ الَّذِىْ اَحْيَانَا بَعْدَمَآ اَمَاتَنَا وَاِلَيْهِ النُّشُوْرُ",
        "meaning": "Segala puji bagi Allah yang telah menghidupkan kami sesudah kami mati (membangunkan dari tidur) dan hanya kepada-Nya kami dikembalikan"
      },
      {
        "id": 9,
        "title": "Doa Selepas Solat",
        "dua": "اَلْحَمْدُ ِللهِ رَبِّ الْعَالَمِيْنَ. حَمْدًا يُوَافِىْ نِعَمَهُ وَيُكَافِئُ مَزِيْدَهُ. يَارَبَّنَالَكَ الْحَمْدُ وَلَكَ الشُّكْرُ كَمَا يَنْبَغِىْ لِجَلاَلِ وَجْهِكَ وَعَظِيْمِ سُلْطَانِكَ",
        "meaning": "Dengan nama Allah Yang Maha Pengasih Lagi Maha Penyayang. Segala puji bagi Allah Tuhan Semesta Alam. Pujian yang sebanding dengan nikmat-nikmatNya dan menjamin tambahannya. Wahai Tuhan kami, bagi-Mu-lah segala puji, dan bagi-Mu-lah segalah syukur, sebagaimana layak bagi keluhuran zat-Mu dan keagungan kekuasaan-Mu."
      },
      {
        "id": 10,
        "title": "Doa Minta Ketenangan",
        "dua": "رَبَّنَا أَخْرِجْنَا مِنْ هَٰذِهِ الْقَرْيَةِ الظَّالِمِ أَهْلُهَا وَاجْعَلْ لَنَا مِنْ لَدُنْكَ",
        "meaning": "Ya Allah, keluarkanlah kami dari tempat ini yang zholim penduduknya ini, dan berilah kami pelindung dari sisi‐Mu serta berilah kami penolong dari Mu” (QS. An‐Nisa: 75)"
      }
    ]